tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_edma.c
/*
 * Copyright 2022-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_edma.h"
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
#include "fsl_memory.h"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.edma4"
#endif
#if defined FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
#define CONVERT_TO_DMA_ADDRESS(addr) (MEMORY_ConvertMemoryMapAddress((uint32_t)(addr), kMEMORY_Local2DMA))
#else
#define CONVERT_TO_DMA_ADDRESS(addr) ((uint32_t)(addr))
#endif
#if defined(DMA_RSTS_N)
#define EDMA_RESETS_ARRAY DMA_RSTS_N
#endif
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Map transfer width.
 *
 * @param width transfer width.
 */
static edma_transfer_size_t EDMA_TransferWidthMapping(uint32_t width);

/*!
 * @brief validate edma errata.
 *
 * @param base edma base address.
 * @param tcd edma transfer content descriptor.
 */
#if defined FSL_FEATURE_EDMA_HAS_ERRATA_51327
static inline status_t EDMA_CheckErrata(EDMA_Type *base, edma_tcd_t *tcd);
#endif
/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Array to map EDMA instance number to base pointer. */
static EDMA_Type *const s_edmaBases[] = EDMA_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Array to map EDMA instance number to clock name. */
static const clock_ip_name_t s_edmaClockName[] = EDMA_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#if defined(FSL_FEATURE_EDMA_HAS_EDMA_TCD_CLOCK_ENABLE) && FSL_FEATURE_EDMA_HAS_EDMA_TCD_CLOCK_ENABLE
/*! @brief Array to map EDMA instance number to clock name. */
static const clock_ip_name_t s_edmaTcdClockName[] = EDMA_TCD_CLOCKS;
#endif
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(EDMA_RESETS_ARRAY)
/* Reset array */
static const reset_ip_name_t s_edmaResets[] = EDMA_RESETS_ARRAY;
#endif

/*! @brief Array to map EDMA instance number to IRQ number. */
static const IRQn_Type s_edmaIRQNumber[][FSL_FEATURE_EDMA_MODULE_CHANNEL] = EDMA_CHN_IRQS;

/*! @brief Pointers to transfer handle for each EDMA channel. */
static edma_handle_t *s_EDMAHandle[FSL_FEATURE_SOC_EDMA_COUNT][FSL_FEATURE_EDMA_MODULE_CHANNEL];
/*******************************************************************************
 * Code
 ******************************************************************************/
static uint32_t EDMA_GetInstance(EDMA_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_edmaBases); instance++)
    {
        if (MSDK_REG_SECURE_ADDR(s_edmaBases[instance]) == MSDK_REG_SECURE_ADDR(base))
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_edmaBases));

    return instance;
}

#if defined FSL_FEATURE_EDMA_HAS_ERRATA_51327
static inline status_t EDMA_CheckErrata(EDMA_Type *base, edma_tcd_t *tcd)
{
    status_t status = kStatus_Success;
    /* errata 51327: to use scatter gather feature, NBYTES must be multiple of 8 */
    if ((uint32_t)FSL_FEATURE_EDMA_INSTANCE_HAS_ERRATA_51327n(base) == 1U)
    {
        if ((EDMA_TCD_NBYTES(tcd, EDMA_TCD_TYPE(base)) % 8U) != 0U)
        {
            assert(false);
            status = kStatus_InvalidArgument;
        }
    }

    return status;
}
#endif

/*!
 * brief Push content of TCD structure into hardware TCD register.
 *
 * param base EDMA peripheral base address.
 * param channel EDMA channel number.
 * param tcd Point to TCD structure.
 */
void EDMA_InstallTCD(EDMA_Type *base, uint32_t channel, edma_tcd_t *tcd)
{
    assert(channel < (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base));
    assert(tcd != NULL);

    edma_tcd_t *tcdRegs = EDMA_TCD_BASE(base, channel);
    /* Avoiding misra_c_2012_rule_13_5_violation event */
    status_t errataStatus = EDMA_CheckErrata(base, tcd);
    uint32_t esgStatus = EDMA_TCD_CSR(tcd, EDMA_TCD_TYPE(base)) & (uint16_t)DMA_CSR_ESG_MASK;

#if defined FSL_FEATURE_EDMA_HAS_ERRATA_51327
    if ((EDMA_TCD_DLAST_SGA(tcd, EDMA_TCD_TYPE(base)) != 0U) && ((esgStatus) != 0U) &&
        (errataStatus != kStatus_Success))
    {
        assert(false);
    }
#endif

    /* Clear DONE bit first, otherwise ESG cannot be set */
    DMA_CLEAR_DONE_STATUS(base, channel);
    /* Push tcd into hardware TCD register */
    EDMA_TCD_SADDR(tcdRegs, EDMA_TCD_TYPE(base))     = EDMA_TCD_SADDR(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_SOFF(tcdRegs, EDMA_TCD_TYPE(base))      = EDMA_TCD_SOFF(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_ATTR(tcdRegs, EDMA_TCD_TYPE(base))      = EDMA_TCD_ATTR(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_NBYTES(tcdRegs, EDMA_TCD_TYPE(base))    = EDMA_TCD_NBYTES(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_SLAST(tcdRegs, EDMA_TCD_TYPE(base))     = EDMA_TCD_SLAST(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_DADDR(tcdRegs, EDMA_TCD_TYPE(base))     = EDMA_TCD_DADDR(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_DOFF(tcdRegs, EDMA_TCD_TYPE(base))      = EDMA_TCD_DOFF(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_CITER(tcdRegs, EDMA_TCD_TYPE(base))     = EDMA_TCD_CITER(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_DLAST_SGA(tcdRegs, EDMA_TCD_TYPE(base)) = EDMA_TCD_DLAST_SGA(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_CSR(tcdRegs, EDMA_TCD_TYPE(base))       = EDMA_TCD_CSR(tcd, EDMA_TCD_TYPE(base));
    EDMA_TCD_BITER(tcdRegs, EDMA_TCD_TYPE(base))     = EDMA_TCD_BITER(tcd, EDMA_TCD_TYPE(base));
}

/*!
 * brief Initializes the eDMA peripheral.
 *
 * This function ungates the eDMA clock and configures the eDMA peripheral according
 * to the configuration structure. All emda enabled request will be cleared in this function.
 *
 * param base eDMA peripheral base address.
 * param config A pointer to the configuration structure, see "edma_config_t".
 * note This function enables the minor loop map feature.
 */
void EDMA_Init(EDMA_Type *base, const edma_config_t *config)
{
    assert(config != NULL);
    assert(FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base) != -1);

