tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_edma.c
    uint32_t tmpreg, i = 0U;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Ungate EDMA peripheral clock */
    CLOCK_EnableClock(s_edmaClockName[EDMA_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(EDMA_RESETS_ARRAY)
    RESET_ReleasePeripheralReset(s_edmaResets[EDMA_GetInstance(base)]);
#endif

#if defined(FSL_EDMA_SOC_IP_EDMA) && FSL_EDMA_SOC_IP_EDMA
    /* clear all the enabled request, status to make sure EDMA status is in normal condition */
    EDMA_CORE_BASE(base)->ERQ = 0U;
    EDMA_CORE_BASE(base)->INT = 0xFFFFFFFFU;
    EDMA_CORE_BASE(base)->ERR = 0xFFFFFFFFU;
    /* Configure EDMA peripheral according to the configuration structure. */
    tmpreg = EDMA_CORE_BASE(base)->CR;
    tmpreg &= ~(DMA_CR_ERCA_MASK | DMA_CR_HOE_MASK | DMA_CR_CLM_MASK | DMA_CR_EDBG_MASK);
    tmpreg |= (DMA_CR_ERCA((config->enableRoundRobinArbitration ? 1U : 0U)) | DMA_CR_HOE((config->enableHaltOnError ? 1U : 0U)) |
               DMA_CR_CLM((config->enableContinuousLinkMode ? 1U : 0U)) | DMA_CR_EDBG((config->enableDebugMode ? 1U : 0U)) | DMA_CR_EMLM(1U));
    EDMA_CORE_BASE(base)->CR = tmpreg;
#else
    tmpreg = EDMA_MP_BASE(base)->MP_CSR;
#if defined FSL_FEATURE_EDMA_HAS_GLOBAL_MASTER_ID_REPLICATION && FSL_FEATURE_EDMA_HAS_GLOBAL_MASTER_ID_REPLICATION
    tmpreg = (tmpreg & ~(DMA_CORE_MP_CSR_HAE_MASK | DMA_CORE_MP_CSR_ERCA_MASK | DMA_CORE_MP_CSR_EDBG_MASK | DMA_CORE_MP_CSR_GCLC_MASK |
                         DMA_CORE_MP_CSR_GMRC_MASK | DMA_CORE_MP_CSR_HALT_MASK)) |
             DMA_CORE_MP_CSR_GMRC((config->enableMasterIdReplication ? 1U : 0U)) | DMA_CORE_MP_CSR_HAE((config->enableHaltOnError ? 1U : 0U)) |
             DMA_CORE_MP_CSR_ERCA((config->enableRoundRobinArbitration ? 1U : 0U)) | DMA_CORE_MP_CSR_EDBG((config->enableDebugMode ? 1U : 0U)) |
             DMA_CORE_MP_CSR_GCLC((config->enableGlobalChannelLink ? 1U : 0U));
#else
    tmpreg = (tmpreg & ~(DMA_CORE_MP_CSR_HAE_MASK | DMA_CORE_MP_CSR_ERCA_MASK | DMA_CORE_MP_CSR_EDBG_MASK | DMA_CORE_MP_CSR_GCLC_MASK |
                         DMA_CORE_MP_CSR_HALT_MASK)) |
             DMA_CORE_MP_CSR_HAE((config->enableHaltOnError ? 1U : 0U)) | DMA_CORE_MP_CSR_ERCA((config->enableRoundRobinArbitration ? 1U : 0U)) |
             DMA_CORE_MP_CSR_EDBG((config->enableDebugMode ? 1U : 0U)) | DMA_CORE_MP_CSR_GCLC((config->enableGlobalChannelLink ? 1U : 0U));
#endif
    EDMA_MP_BASE(base)->MP_CSR = tmpreg;

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG && FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG
    /* channel transfer configuration */
    for (i = 0U; i < (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base); i++)
    {
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#if defined(FSL_FEATURE_EDMA_HAS_EDMA_TCD_CLOCK_ENABLE) && FSL_FEATURE_EDMA_HAS_EDMA_TCD_CLOCK_ENABLE
        /* Ungate EDMA TCD peripheral clock */
        CLOCK_EnableClock(s_edmaTcdClockName[i]);
#endif
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
        if (config->channelConfig[i] != NULL)
        {
            EDMA_InitChannel(base, i, config->channelConfig[i]);
        }
    }
#endif
#endif
}

/*!
 * brief Deinitializes the eDMA peripheral.
 *
 * This function gates the eDMA clock.
 *
 * param base eDMA peripheral base address.
 */
void EDMA_Deinit(EDMA_Type *base)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Gate EDMA peripheral clock */
    CLOCK_DisableClock(s_edmaClockName[EDMA_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#if defined(FSL_FEATURE_EDMA_HAS_EDMA_TCD_CLOCK_ENABLE) && FSL_FEATURE_EDMA_HAS_EDMA_TCD_CLOCK_ENABLE
    for (uint32_t i = 0U; i < (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base); i++)
    {
        /* Gate EDMA TCD peripheral clock */
        CLOCK_DisableClock(s_edmaTcdClockName[i]);
    }
#endif
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG && FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG
/*!
 * brief EDMA Channel initialization
 *
 * param base eDMA peripheral base address.
 * param channel eDMA channel number.
 * param channelConfig pointer to user's eDMA channel config structure, see edma_channel_config_t for detail.
 */
void EDMA_InitChannel(EDMA_Type *base, uint32_t channel, edma_channel_config_t *channelConfig)
{
    assert(channelConfig != NULL);

    EDMA_SetChannelPreemptionConfig(base, channel, &channelConfig->channelPreemptionConfig);

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE && FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE
    EDMA_SetChannelSwapSize(base, channel, channelConfig->channelSwapSize);
#endif

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE && FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE
    EDMA_SetChannelMemoryAttribute(base, channel, channelConfig->channelWriteMemoryAttribute,
                                   channelConfig->channelReadMemoryAttribute);
#endif
#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_SIGN_EXTENSION && FSL_FEATURE_EDMA_HAS_CHANNEL_SIGN_EXTENSION
    EDMA_SetChannelSignExtension(base, channel, channelConfig->channelDataSignExtensionBitPosition);
#endif
#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE && FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE
    EDMA_SetChannelAccessType(base, channel, channelConfig->channelAccessType);
#endif

#if (defined FSL_FEATURE_EDMA_HAS_CHANNEL_MUX && FSL_FEATURE_EDMA_HAS_CHANNEL_MUX) || \
    (defined FSL_FEATURE_EDMA_HAS_MP_CHANNEL_MUX && FSL_FEATURE_EDMA_HAS_MP_CHANNEL_MUX)
    if (0U != (uint32_t)channelConfig->channelRequestSource)
    {
        /* dma request source */
        EDMA_SetChannelMux(base, channel, (uint32_t)channelConfig->channelRequestSource);
    }
#endif

    /* master ID replication */
    EDMA_EnableChannelMasterIDReplication(base, channel, channelConfig->enableMasterIDReplication);
#if !(defined(FSL_FEATURE_EDMA_HAS_NO_CH_SBR_SEC) && FSL_FEATURE_EDMA_HAS_NO_CH_SBR_SEC)
    /* dma transfer security level */
    EDMA_SetChannelSecurityLevel(base, channel, channelConfig->securityLevel);
#endif
    /* dma transfer protection level */
    EDMA_SetChannelProtectionLevel(base, channel, channelConfig->protectionLevel);
}
#endif

/*!
 * brief Gets the eDMA default configuration structure.
 *
 * This function sets the configuration structure to default values.
 * The default configuration is set to the following values.
 * code
 *   config.enableContinuousLinkMode = false;
 *   config.enableHaltOnError = true;
 *   config.enableRoundRobinArbitration = false;
 *   config.enableDebugMode = false;
 * endcode
 *
 * param config A pointer to the eDMA configuration structure.
 */
void EDMA_GetDefaultConfig(edma_config_t *config)
{
    assert(config != NULL);

    /* Initializes the configure structure to zero. */
    (void)memset(config, 0, sizeof(*config));

    config->enableRoundRobinArbitration = false;

    config->enableHaltOnError = true;

